In [55]:
import pandas as pd

In [56]:
import numpy as np

In [57]:
df = pd.read_csv('cleaning.csv')

In [58]:
df

   ST_NUM     ST_NAME OWN_OCC NUM_BED
0   104.0      PUTNAM       Y       3
1   197.0   LEXINGTON       N       3
2     NaN     BERKELY       N     NaN
3   201.0     BERKELY      12       1
4   203.0     BERKELY       Y       3
5   207.0  WASHINGTON       Y       2
6     NaN     TREMONT     NaN     - -
7   213.0     TREMONT       Y     N/a
8   215.0     TREMONT       Y      No

In [59]:
df.keys

<bound method NDFrame.keys of    ST_NUM     ST_NAME OWN_OCC NUM_BED
0   104.0      PUTNAM       Y       3
1   197.0   LEXINGTON       N       3
2     NaN     BERKELY       N     NaN
3   201.0     BERKELY      12       1
4   203.0     BERKELY       Y       3
5   207.0  WASHINGTON       Y       2
6     NaN     TREMONT     NaN     - -
7   213.0     TREMONT       Y     N/a
8   215.0     TREMONT       Y      No>

In [60]:
df['ST_NUM']

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [61]:
df['ST_NUM'].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [62]:
df['ST_NUM'].isnull().sum()

2

In [63]:
missing_values = ['N/a','No','- -']
df = pd.read_csv('cleaning.csv',na_values=missing_values)

In [64]:
df

   ST_NUM     ST_NAME OWN_OCC  NUM_BED
0   104.0      PUTNAM       Y      3.0
1   197.0   LEXINGTON       N      3.0
2     NaN     BERKELY       N      NaN
3   201.0     BERKELY      12      1.0
4   203.0     BERKELY       Y      3.0
5   207.0  WASHINGTON       Y      2.0
6     NaN     TREMONT     NaN      NaN
7   213.0     TREMONT       Y      NaN
8   215.0     TREMONT       Y      NaN

In [65]:
count = 0
for row in df['OWN_OCC']:
    try:
        int(row)
        df.loc[count,'OWN_OCC'] = np.nan
    except:
        pass
    count+=1

In [66]:
df

   ST_NUM     ST_NAME OWN_OCC  NUM_BED
0   104.0      PUTNAM       Y      3.0
1   197.0   LEXINGTON       N      3.0
2     NaN     BERKELY       N      NaN
3   201.0     BERKELY     NaN      1.0
4   203.0     BERKELY       Y      3.0
5   207.0  WASHINGTON       Y      2.0
6     NaN     TREMONT     NaN      NaN
7   213.0     TREMONT       Y      NaN
8   215.0     TREMONT       Y      NaN

In [67]:
count

9

In [68]:
df['ST_NUM'].fillna(125)

0    104.0
1    197.0
2    125.0
3    201.0
4    203.0
5    207.0
6    125.0
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [69]:
df['ST_NUM'].fillna(125,inplace=True)

In [70]:
df

   ST_NUM     ST_NAME OWN_OCC  NUM_BED
0   104.0      PUTNAM       Y      3.0
1   197.0   LEXINGTON       N      3.0
2   125.0     BERKELY       N      NaN
3   201.0     BERKELY     NaN      1.0
4   203.0     BERKELY       Y      3.0
5   207.0  WASHINGTON       Y      2.0
6   125.0     TREMONT     NaN      NaN
7   213.0     TREMONT       Y      NaN
8   215.0     TREMONT       Y      NaN

In [71]:
df['NUM_BED'].fillna(0,inplace=True)

In [72]:
df

   ST_NUM     ST_NAME OWN_OCC  NUM_BED
0   104.0      PUTNAM       Y      3.0
1   197.0   LEXINGTON       N      3.0
2   125.0     BERKELY       N      0.0
3   201.0     BERKELY     NaN      1.0
4   203.0     BERKELY       Y      3.0
5   207.0  WASHINGTON       Y      2.0
6   125.0     TREMONT     NaN      0.0
7   213.0     TREMONT       Y      0.0
8   215.0     TREMONT       Y      0.0

In [73]:
df['OWN_OCC'].dropna()

0    Y
1    N
2    N
4    Y
5    Y
7    Y
8    Y
Name: OWN_OCC, dtype: object

In [82]:
df['OWN_OCC'].dropna()

0    Y
1    N
2    N
4    Y
5    Y
7    Y
8    Y
Name: OWN_OCC, dtype: object

In [87]:
df.dropna(inplace=True)

In [89]:
df.to_csv('cleaned.csv')